Tekla Open API Reference for Tekla Structures 2025
Mesh Constructor (ArrayList, ArrayList, ArrayList)
 Creates a new mesh instance with the given points, triangles and lines. Does not check the indices in the given triangles and lines array lists for correctness.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Mesh(
	ArrayList Points,
	ArrayList Triangles,
	ArrayList Lines
)
Public Sub New (
	Points As ArrayList,
	Triangles As ArrayList,
	Lines As ArrayList
)
Parameters
Points
Type: System.Collections.ArrayList
An array list of point objects representing the mesh points. Null represents no points.
Triangles
Type: System.Collections.ArrayList
An array list of indices (of type integer) pointing to the points array list. Three consecutive indices represent a single triangle. The first index is 0. If null, the mesh will not contain any triangles.
Lines
Type: System.Collections.ArrayList
An array list of indices (of type integer) pointing to the points array list. Two consecutive indices represent a single line. The first index is 0. If null, the mesh will not contain any lines.
See Also
Reference
Mesh Class
Mesh Overload
Tekla.Structures.Model.UI Namespace